# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'caskroom/drivers'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Binaries
brew 'mas'
brew 'git'
brew 'mackup'
brew 'node'
brew 'wget'

# Development
brew 'php'
brew 'mysql'

# Apps
cask 'aerial'
cask '1password'
cask 'firefox'
cask 'sublime-text'
cask 'iterm2'
cask 'keepingyouawake'
cask 'dropbox'
cask 'tunnelblick'
cask 'vagrant-manager'
cask 'vagrant'
cask 'virtualbox'
cask 'spotify'
cask 'alfred'
cask 'google-backup-and-sync'
cask 'insomnia'
cask 'macdown'
cask 'mactracker'
cask 'moom'
cask 'omnidisksweeper'
cask 'plex-media-player'
cask 'sequel-pro'
cask 'sketchup-pro'
cask 'skitch'
cask 'slack'
cask 'sourcetree'
cask 'staruml'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'shuttle'
cask 'java'
cask 'visual-studio-code'
cask 'logitech-options'
cask 'docker'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-roboto'
cask 'font-open-sans'
cask 'font-fira-code'
cask 'font-iosevka'
cask 'font-lato'

# App Store
mas 'Contrast', id: 1254981365
mas 'ColorSnapper 2', id: 969418666
mas 'Localizable Strings Merge', id: 475333727
mas 'Spark', id: 1176895641
mas 'Deliveries', id: 924726344