# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'caskroom/drivers'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Drivers
brew 'logitech-options'

# Binaries
brew 'mas'
brew 'git'
brew 'mackup'
brew 'node'
brew 'wget'

# Development
brew 'php'
brew 'mysql'

# Apps
brew '1password'
brew 'firefox'
brew 'sublime-text'
brew 'iterm2'
brew 'keepingyouawake'
brew 'dropbox'
brew 'tunnelblick'
brew 'vagrant-manager'
brew 'vagrant'
brew 'virtualbox'
brew 'spotify'
brew 'alfred'
brew 'google-backup-and-sync'
brew 'insomnia'
brew 'macdown'
brew 'mactracker'
brew 'moom'
brew 'omnidisksweeper'
brew 'plex-media-player'
brew 'sequel-pro'
brew 'sketchup-pro'
brew 'skitch'
brew 'slack'
brew 'sourcetree'
brew 'staruml'
brew 'the-unarchiver'
brew 'transmission'
brew 'vlc'
brew 'shuttle'
brew 'java'
brew 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-roboto'
cask 'font-open-sans'
cask 'font-fira-code'
cask 'font-iosevka'
cask 'font-lato'

# App Store
mas 'Contrast', id: 1254981365
mas 'ColorSnapper 2', id: 969418666
mas 'Localizable Strings Merge', id: 475333727
mas 'Spark', id: 1176895641
mas 'Deliveries', id: 924726344
